modules/business/controllers/CustomerController.php

    public function actionCreate()
    {
        $model = new CustomerDetails();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
            if($model->previous_balance >0){
                $obj_trans = new Transactions();
                $obj_trans->customer_id =$model->id;
                $obj_trans->balance=$model->previous_balance;
                $obj_trans->ivoice_amount=0;
                $obj_trans->created_on=date("Y-m-d");
                $obj_trans->from_sheet_id=0;
                $obj_trans->to_sheet_id=0;
                $obj_trans->status='closed';
                if($obj_trans->save()){
---
INSERT INTO `bur_customer_details` (`name`, `place`, `address`, `account_details`, `customer_type`, `phone`, `status`) VALUES ('dfgdfg', 'dfgdfgdfg', 'dfgdf', 'gdfgdfgdfg', 1, '3453534534', '1')
INSERT INTO `bur_transactions` (`customer_id`, `balance`, `ivoice_amount`, `created_on`, `from_sheet_id`, `to_sheet_id`, `status`) VALUES (2, 345, 0, '2016-10-17', 0, 0, 'closed')

    protected function findModel($id)
    {
        if (($model = CustomerDetails::findOne($id)) !== null) {
---
SELECT * FROM `bur_customer_details` WHERE `id`='2'

    public function actionPrice(){
	  //echo $id= $_GET['id'];exit;
	  $searchModel = new MaterialTypesSearch();
	  $model = new CustomerDetails();
	  $customer_id = $_REQUEST['id'];
	  $searchModel->customer=$customer_id;
	  if(isset($_POST['price'])){


		$selected = $_POST['price'];
		foreach($selected as $key => $val){
		  $objMaterialPrice=new CustomerMaterialPrice();
		  $material_id=$key;
		  $material_price =$val;

		  $count = CustomerMaterialPrice::find()->where(['customer_id'=>$customer_id,'material_id'=>$material_id])->count();
		  if($count>0){
		  $objMaterialPrice=CustomerMaterialPrice::findOne(['customer_id'=>$customer_id,'material_id'=>$material_id]);
		  }
		  $objMaterialPrice->customer_id =$customer_id;
		  $objMaterialPrice->material_id = $material_id;
		  $objMaterialPrice->price=$material_price;
		  $objMaterialPrice->status=1;

		  $objMaterialPrice->save();
---
SELECT COUNT(*) FROM `bur_customer_material_price` WHERE (`customer_id`='1') AND (`material_id`=3)
INSERT INTO `bur_customer_material_price` (`customer_id`, `material_id`, `price`, `status`) VALUES (1, 3, 20, '1')