modules/business/controllers/MaterialController.php

    public function actionCreate()
    {
        $model = new MaterialTypes();
        $model->measurement_type = 1;

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `bur_material_types` (`measurement_type`, `name`, `description`, `price`, `status`) VALUES (1, 'gfh', 'gfhfghfghfg', 'h123', '1')

    protected function findModel($id)
    {
        if (($model = MaterialTypes::findOne($id)) !== null) {
---
SELECT * FROM `bur_material_types` WHERE `id`='1'