modules/business/views/trips/_form.php

SELECT * FROM `bur_customer_details` WHERE (`status`=1) AND (`customer_type`=1) ORDER BY `name`
---

        <div class="col-xs-12 col-sm-6 col-lg-6">
        <?php
            echo $form->field($model, 'merchant')->widget(Select2::classname(), [
            'data' => ArrayHelper::map(CustomerDetails::find()->where(['status'=>1,'customer_type'=>1])->orderBy('name')->all(), 'id', 'name'),
            'options' => ['placeholder' => 'Select Merchant ...','style'=>'width:500px','onChange'=>'merchantAmount();'],
            'pluginOptions' => [
            'allowClear' => true
            ],
            ]);

SELECT * FROM `bur_customer_details` WHERE (`status`=1) AND (`customer_type`=2) ORDER BY `name`
---
    <div class="col-xs-12 col-lg-12 no-padding">
        <div class="col-xs-12 col-sm-6 col-lg-6">
         <?php
            echo $form->field($model, 'buyer')->widget(Select2::classname(), [
            'data' => ArrayHelper::map(CustomerDetails::find()->where(['status'=>1,'customer_type'=>2])->orderBy('name')->all(), 'id', 'name'),
            'options' => ['placeholder' => 'Select Customer ...','style'=>'width:500px','onChange'=>'buyerAmount();'],
            'pluginOptions' => [
            'allowClear' => true
            ],
            ]);

SELECT * FROM `bur_vehicle_details` WHERE `status`=1
---
        );*/?>
        </div>
        <div class="col-xs-12 col-sm-6 col-lg-6">
        <?= $form->field($model, 'vehicle_id')
        ->dropDownList(
        ArrayHelper::map(VehicleDetails::find()->where(['status'=>1])->all(), 'id', 'name'),
        ['prompt'=>'Select Vehicle','style'=>'width:500px','id'=>'vehicle-id','onChange'=>'calculateKMA();']
        );?>

SELECT * FROM `bur_material_types` WHERE `status`=1
---
        ?>
        </div>
        <div class="col-xs-12 col-sm-6 col-lg-6">
        <?= $form->field($model, 'material_id')
        ->dropDownList(
        ArrayHelper::map(MaterialTypes::find()->where(['status'=>1])->all(), 'id', function($model, $defaultValue) {
        return $model->name.' - '.MaterialTypes::$measurementType[$model->measurement_type];
        }
        ),
        ['prompt'=>'Select Material','style'=>'width:500px','onChange'=>'merchantAmount();buyerAmount();changematerial()']
        );?>