modules/business/views/trips/index.php

SELECT * FROM `bur_customer_details` WHERE `customer_type`=1
---
	'label'=>'Merchant',
    'attribute'=>"merchant",
    'value' => 'merchants.name',
	'filter' => ArrayHelper::map(app\modules\business\models\CustomerDetails::find()->where(['customer_type'=>1])->all(), 'id', 'name')

SELECT * FROM `bur_customer_details` WHERE `customer_type`=2
---
	'label'=>'Customer',
    'attribute'=>"buyer",
    'value' => 'buyers.name',
	'filter' => ArrayHelper::map(app\modules\business\models\CustomerDetails::find()->where(['customer_type'=>2])->all(), 'id', 'name')

SELECT * FROM `bur_customer_details` WHERE `customer_type`=3
---
	  ['label'=>'Driver',
	    'attribute'=>"driver_id",
	    'value' => 'driver.name',
	    'filter' => ArrayHelper::map(app\modules\business\models\CustomerDetails::find()->where(['customer_type'=>3])->all(), 'id', 'name')