modules/business/views/reports/vehiclem.php

	]); ?>

    <div class="col-md-3">
		  <?= $form->field($model, 'vehicle_id')
        ->dropDownList(
            ArrayHelper::map(VehicleDetails::find()->where(['status'=>1])->all(), 'id', 'name'),
            ['prompt'=>'Select a vehicle','style'=>'width:200px','onchange'=>'this.form.submit()']
        );?>
---
SELECT * FROM `bur_vehicle_details` WHERE `status`=1


	<div class="col-md-3">
	  <?php
	  echo $form->field($model, 'merchant')->widget(Select2::classname(), [
	  'data' => ArrayHelper::map(CustomerDetails::find()->where(['status'=>1,'customer_type'=>1])->orderBy('name')->all(), 'id', 'name'),
	  'options' => ['placeholder' => 'Select Merchant ...','style'=>'width:200px','onChange'=>'this.form.submit()'],
	  'pluginOptions' => [
	  'allowClear' => true
	  ],
	  ]);
---
SELECT * FROM `bur_customer_details` WHERE (`status`=1) AND (`customer_type`=1) ORDER BY `name`


	<div class="col-md-5">
         <?php
            echo $form->field($model, 'buyer')->widget(Select2::classname(), [
            'data' => ArrayHelper::map(CustomerDetails::find()->where(['status'=>1,'customer_type'=>2])->all(), 'id', 'name'),
            'options' => ['placeholder' => 'Select Customer ...','style'=>'width:200px','onChange'=>'this.form.submit()'],
            'pluginOptions' => [
            'allowClear' => true
            ],
            ]);
---
SELECT * FROM `bur_customer_details` WHERE (`status`=1) AND (`customer_type`=2)